#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: PreferredItemSlotsExtension

#include "Basic.hpp"


namespace SDK::Params
{

// Function PreferredItemSlotsExtension.PreferredItemSlotsExtension_C.ExecuteUbergraph_PreferredItemSlotsExtension
// 0x0028 (0x0028 - 0x0000)
struct PreferredItemSlotsExtension_C_ExecuteUbergraph_PreferredItemSlotsExtension final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<class UImage*>                         K2Node_MakeArray_Array;                            // 0x0008(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<class UImage*>                         K2Node_MakeArray_Array_1;                          // 0x0018(0x0010)(ReferenceParm, ContainsInstancedReference)
};

// Function PreferredItemSlotsExtension.PreferredItemSlotsExtension_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct PreferredItemSlotsExtension_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

